{
  "plan_name": "medicare",
  "plan_id_type": "HIOS",
  "plan_id": "12345XX9876543",
  "market_type": "individual",


  // Lowering premiums vs out of pocket costs (cost sharing)
  // There is an industry argument in lower premiums overall vs specific cost sharing.
  "drugs": [{
    "drug_name": "The generic name of the drug", 
    "drug_type": "branded", // This could either "branded" or "generic" type? 
    "ndc_11": "11 digit number", 
    "hcpc_code": "", // needed now?

    // TODO: determine "list price" or "MAC". 
    // NOTE: for generics, ideally the MAC would be used (the is bc this number would be more relevant to the consumer/member/bene), if not, then the list price would be used
    "list_price": xxx.xx,
    
    // Does it make more since to use the MAC (maximum allowable cost). This number is set by the plan
    // The MAC doesn't not exist for branded drugs. This is used bc of how frequent the price changes. The flux of generic drug pricing needs to be protected against.
    // TODO: determine if MAC is an industry-wide accepted term. We might need to find the commonly accepted definition and include that in the rule.
    "maximum_allowable_cost": xxx.xx,


    // The discounts/rebates that go into this price are proprietary. This would be an aggregate and would "black box" the specific discounts?
    // The manufacturers are potentially the ones that don't want the rebates to be "released" -- plans might not be as concerned.

    // NOTE: there are discounts that aren't tied specifically to the drug (e.g. total volume that could provide something like a 3% discount across all or some drugs)
    // NOTE: Medicaid MCOs are included thus you do not have to worry about "340b"? discounts.
    // Pricing for generics will be easier. Most likely less concessions tied to generics than branded. This number would require going through claims history for x amount of months.
    // NOTE: this would be required for both generics and branded drugs.
    "historical_net_amount": xxx.xx,

    "npi":[ 3911647310, 3911647310, 3911647210, 3211647310, 2911647310, 3912647310]
  },







    // Old schema with 'net unit price'
    "prices": [{ 
      "plan_name": "bcbs standard plan",
      "plan_id_type": "bcbs standard plan",
      "plan_id": "bcbs standard plan",
      "net_unit_price": 0.0001, 
      "providers":[ 3911647310 ],  
      "pharmacies":[ 3911647310, 3911647310 ] 
    },{
      "net_unit_price": 0.0002,
      "pharmacies":[ 3911647310, 3911647310, 3911647210, 3211647310, 2911647310, 3912647310]
    }]
  }]
}
